7767517
224 243
Input            input                    0 1 input
Convolution      400                      1 1 input 400 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=432
BatchNorm        401                      1 1 400 401 0=16
HardSwish        407                      1 1 401 407 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 407 407_splitncnn_0 407_splitncnn_1
Convolution      408                      1 1 407_splitncnn_1 408 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        409                      1 1 408 409 0=16
ReLU             410                      1 1 409 410
ConvolutionDepthWise 411                      1 1 410 411 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        412                      1 1 411 412 0=16
ReLU             413                      1 1 412 413
Convolution      414                      1 1 413 414 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        415                      1 1 414 415 0=16
BinaryOp         416                      2 1 415 407_splitncnn_0 416 0=0
Convolution      417                      1 1 416 417 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        418                      1 1 417 418 0=64
ReLU             419                      1 1 418 419
ConvolutionDepthWise 420                      1 1 419 420 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        421                      1 1 420 421 0=64
ReLU             422                      1 1 421 422
Convolution      423                      1 1 422 423 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        424                      1 1 423 424 0=24
Split            splitncnn_1              1 2 424 424_splitncnn_0 424_splitncnn_1
Convolution      425                      1 1 424_splitncnn_1 425 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728
BatchNorm        426                      1 1 425 426 0=72
ReLU             427                      1 1 426 427
ConvolutionDepthWise 428                      1 1 427 428 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=648 7=72
BatchNorm        429                      1 1 428 429 0=72
ReLU             430                      1 1 429 430
Convolution      431                      1 1 430 431 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728
BatchNorm        432                      1 1 431 432 0=24
BinaryOp         433                      2 1 432 424_splitncnn_0 433 0=0
Convolution      434                      1 1 433 434 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728
BatchNorm        435                      1 1 434 435 0=72
ReLU             436                      1 1 435 436
ConvolutionDepthWise 437                      1 1 436 437 0=72 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=1800 7=72
BatchNorm        438                      1 1 437 438 0=72
ReLU             439                      1 1 438 439
Convolution      440                      1 1 439 440 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2880
BatchNorm        441                      1 1 440 441 0=40
Split            splitncnn_2              1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution      442                      1 1 441_splitncnn_1 442 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        443                      1 1 442 443 0=10
ReLU             444                      1 1 443 444
Convolution      445                      1 1 444 445 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        446                      1 1 445 446 0=40
HardSigmoid      451                      1 1 446 451 0=1.666667e-01 1=5.000000e-01
BinaryOp         452                      2 1 441_splitncnn_0 451 452 0=2
Split            splitncnn_3              1 2 452 452_splitncnn_0 452_splitncnn_1
Convolution      453                      1 1 452_splitncnn_1 453 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4800
BatchNorm        454                      1 1 453 454 0=120
ReLU             455                      1 1 454 455
ConvolutionDepthWise 456                      1 1 455 456 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3000 7=120
BatchNorm        457                      1 1 456 457 0=120
ReLU             458                      1 1 457 458
Convolution      459                      1 1 458 459 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4800
BatchNorm        460                      1 1 459 460 0=40
Split            splitncnn_4              1 2 460 460_splitncnn_0 460_splitncnn_1
Convolution      461                      1 1 460_splitncnn_1 461 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        462                      1 1 461 462 0=10
ReLU             463                      1 1 462 463
Convolution      464                      1 1 463 464 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        465                      1 1 464 465 0=40
HardSigmoid      470                      1 1 465 470 0=1.666667e-01 1=5.000000e-01
BinaryOp         471                      2 1 460_splitncnn_0 470 471 0=2
BinaryOp         472                      2 1 471 452_splitncnn_0 472 0=0
Split            splitncnn_5              1 2 472 472_splitncnn_0 472_splitncnn_1
Convolution      473                      1 1 472_splitncnn_1 473 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4800
BatchNorm        474                      1 1 473 474 0=120
ReLU             475                      1 1 474 475
ConvolutionDepthWise 476                      1 1 475 476 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3000 7=120
BatchNorm        477                      1 1 476 477 0=120
ReLU             478                      1 1 477 478
Convolution      479                      1 1 478 479 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4800
BatchNorm        480                      1 1 479 480 0=40
Split            splitncnn_6              1 2 480 480_splitncnn_0 480_splitncnn_1
Convolution      481                      1 1 480_splitncnn_1 481 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        482                      1 1 481 482 0=10
ReLU             483                      1 1 482 483
Convolution      484                      1 1 483 484 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        485                      1 1 484 485 0=40
HardSigmoid      490                      1 1 485 490 0=1.666667e-01 1=5.000000e-01
BinaryOp         491                      2 1 480_splitncnn_0 490 491 0=2
BinaryOp         492                      2 1 491 472_splitncnn_0 492 0=0
Convolution      493                      1 1 492 493 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        494                      1 1 493 494 0=240
HardSwish        500                      1 1 494 500 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 501                      1 1 500 501 0=240 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=2160 7=240
BatchNorm        502                      1 1 501 502 0=240
HardSwish        508                      1 1 502 508 0=1.666667e-01 1=5.000000e-01
Convolution      509                      1 1 508 509 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=19200
BatchNorm        510                      1 1 509 510 0=80
Split            splitncnn_7              1 2 510 510_splitncnn_0 510_splitncnn_1
Convolution      511                      1 1 510_splitncnn_1 511 0=200 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16000
BatchNorm        512                      1 1 511 512 0=200
HardSwish        518                      1 1 512 518 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 519                      1 1 518 519 0=200 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1800 7=200
BatchNorm        520                      1 1 519 520 0=200
HardSwish        526                      1 1 520 526 0=1.666667e-01 1=5.000000e-01
Convolution      527                      1 1 526 527 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16000
BatchNorm        528                      1 1 527 528 0=80
BinaryOp         529                      2 1 528 510_splitncnn_0 529 0=0
Split            splitncnn_8              1 2 529 529_splitncnn_0 529_splitncnn_1
Convolution      530                      1 1 529_splitncnn_1 530 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=14720
BatchNorm        531                      1 1 530 531 0=184
HardSwish        537                      1 1 531 537 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 538                      1 1 537 538 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1656 7=184
BatchNorm        539                      1 1 538 539 0=184
HardSwish        545                      1 1 539 545 0=1.666667e-01 1=5.000000e-01
Convolution      546                      1 1 545 546 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=14720
BatchNorm        547                      1 1 546 547 0=80
BinaryOp         548                      2 1 547 529_splitncnn_0 548 0=0
Split            splitncnn_9              1 2 548 548_splitncnn_0 548_splitncnn_1
Convolution      549                      1 1 548_splitncnn_1 549 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=14720
BatchNorm        550                      1 1 549 550 0=184
HardSwish        556                      1 1 550 556 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 557                      1 1 556 557 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1656 7=184
BatchNorm        558                      1 1 557 558 0=184
HardSwish        564                      1 1 558 564 0=1.666667e-01 1=5.000000e-01
Convolution      565                      1 1 564 565 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=14720
BatchNorm        566                      1 1 565 566 0=80
BinaryOp         567                      2 1 566 548_splitncnn_0 567 0=0
Split            splitncnn_10             1 2 567 567_splitncnn_0 567_splitncnn_1
Convolution      568                      1 1 567_splitncnn_1 568 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=38400
BatchNorm        569                      1 1 568 569 0=480
HardSwish        575                      1 1 569 575 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 576                      1 1 575 576 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=4320 7=480
BatchNorm        577                      1 1 576 577 0=480
HardSwish        583                      1 1 577 583 0=1.666667e-01 1=5.000000e-01
Convolution      584                      1 1 583 584 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=53760
BatchNorm        585                      1 1 584 585 0=112
Split            splitncnn_11             1 2 585 585_splitncnn_0 585_splitncnn_1
Convolution      586                      1 1 585_splitncnn_1 586 0=28 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3136
BatchNorm        587                      1 1 586 587 0=28
ReLU             588                      1 1 587 588
Convolution      589                      1 1 588 589 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3136
BatchNorm        590                      1 1 589 590 0=112
HardSigmoid      595                      1 1 590 595 0=1.666667e-01 1=5.000000e-01
BinaryOp         596                      2 1 585_splitncnn_0 595 596 0=2
Convolution      597                      1 1 567_splitncnn_0 597 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8960
BatchNorm        598                      1 1 597 598 0=112
BinaryOp         599                      2 1 596 598 599 0=0
Split            splitncnn_12             1 2 599 599_splitncnn_0 599_splitncnn_1
Convolution      600                      1 1 599_splitncnn_1 600 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=75264
BatchNorm        601                      1 1 600 601 0=672
HardSwish        607                      1 1 601 607 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 608                      1 1 607 608 0=672 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=6048 7=672
BatchNorm        609                      1 1 608 609 0=672
HardSwish        615                      1 1 609 615 0=1.666667e-01 1=5.000000e-01
Convolution      616                      1 1 615 616 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=75264
BatchNorm        617                      1 1 616 617 0=112
Split            splitncnn_13             1 2 617 617_splitncnn_0 617_splitncnn_1
Convolution      618                      1 1 617_splitncnn_1 618 0=28 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3136
BatchNorm        619                      1 1 618 619 0=28
ReLU             620                      1 1 619 620
Convolution      621                      1 1 620 621 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3136
BatchNorm        622                      1 1 621 622 0=112
HardSigmoid      627                      1 1 622 627 0=1.666667e-01 1=5.000000e-01
BinaryOp         628                      2 1 617_splitncnn_0 627 628 0=2
BinaryOp         629                      2 1 628 599_splitncnn_0 629 0=0
Split            splitncnn_14             1 2 629 629_splitncnn_0 629_splitncnn_1
Convolution      630                      1 1 629_splitncnn_1 630 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=75264
BatchNorm        631                      1 1 630 631 0=672
HardSwish        637                      1 1 631 637 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 638                      1 1 637 638 0=672 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=16800 7=672
BatchNorm        639                      1 1 638 639 0=672
HardSwish        645                      1 1 639 645 0=1.666667e-01 1=5.000000e-01
Convolution      646                      1 1 645 646 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=107520
BatchNorm        647                      1 1 646 647 0=160
Split            splitncnn_15             1 2 647 647_splitncnn_0 647_splitncnn_1
Convolution      648                      1 1 647_splitncnn_1 648 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6400
BatchNorm        649                      1 1 648 649 0=40
ReLU             650                      1 1 649 650
Convolution      651                      1 1 650 651 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6400
BatchNorm        652                      1 1 651 652 0=160
HardSigmoid      657                      1 1 652 657 0=1.666667e-01 1=5.000000e-01
BinaryOp         658                      2 1 647_splitncnn_0 657 658 0=2
Convolution      659                      1 1 629_splitncnn_0 659 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=17920
BatchNorm        660                      1 1 659 660 0=160
BinaryOp         661                      2 1 658 660 661 0=0
Convolution      662                      1 1 661 662 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=107520
BatchNorm        663                      1 1 662 663 0=672
HardSwish        669                      1 1 663 669 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 670                      1 1 669 670 0=672 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=16800 7=672
BatchNorm        671                      1 1 670 671 0=672
HardSwish        677                      1 1 671 677 0=1.666667e-01 1=5.000000e-01
Convolution      678                      1 1 677 678 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=107520
BatchNorm        679                      1 1 678 679 0=160
Split            splitncnn_16             1 2 679 679_splitncnn_0 679_splitncnn_1
Convolution      680                      1 1 679_splitncnn_1 680 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6400
BatchNorm        681                      1 1 680 681 0=40
ReLU             682                      1 1 681 682
Convolution      683                      1 1 682 683 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6400
BatchNorm        684                      1 1 683 684 0=160
HardSigmoid      689                      1 1 684 689 0=1.666667e-01 1=5.000000e-01
BinaryOp         690                      2 1 679_splitncnn_0 689 690 0=2
Split            splitncnn_17             1 2 690 690_splitncnn_0 690_splitncnn_1
Convolution      691                      1 1 690_splitncnn_1 691 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        692                      1 1 691 692 0=960
HardSwish        698                      1 1 692 698 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 699                      1 1 698 699 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=24000 7=960
BatchNorm        700                      1 1 699 700 0=960
HardSwish        706                      1 1 700 706 0=1.666667e-01 1=5.000000e-01
Convolution      707                      1 1 706 707 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        708                      1 1 707 708 0=160
Split            splitncnn_18             1 2 708 708_splitncnn_0 708_splitncnn_1
Convolution      709                      1 1 708_splitncnn_1 709 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6400
BatchNorm        710                      1 1 709 710 0=40
ReLU             711                      1 1 710 711
Convolution      712                      1 1 711 712 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6400
BatchNorm        713                      1 1 712 713 0=160
HardSigmoid      718                      1 1 713 718 0=1.666667e-01 1=5.000000e-01
BinaryOp         719                      2 1 708_splitncnn_0 718 719 0=2
BinaryOp         720                      2 1 719 690_splitncnn_0 720 0=0
Convolution      721                      1 1 720 721 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        722                      1 1 721 722 0=960
HardSwish        728                      1 1 722 728 0=1.666667e-01 1=5.000000e-01
Padding          729                      1 1 728 729 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00
Pooling          730                      1 1 729 730 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1 6=0
Flatten          738                      1 1 730 738
InnerProduct     739                      1 1 738 739 0=1280 1=1 2=1228800
BatchNorm        742                      1 1 739 742 0=1280
HardSwish        748                      1 1 742 748 0=1.666667e-01 1=5.000000e-01
InnerProduct     output                   1 1 748 output 0=7 1=1 2=8960
